Revit 2027 API
DockablePaneProviderData.FrameworkElement Property
 The Windows Presentation Framework object containing the pane's user interface.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FrameworkElement FrameworkElement { get; set; }
Public Property FrameworkElement As FrameworkElement
	Get
	Set
public:
property FrameworkElement^ FrameworkElement {
	FrameworkElement^ get ();
	void set (FrameworkElement^ value);
}
member FrameworkElement : FrameworkElement with get, set
Property Value
FrameworkElement
Remarks
 Using a System.Windows.Controls.Page is recommended. This can be null, in which case it is assumed an IFrameworkElementCreator is provided to create the element on demand.
See Also
Reference
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace